#### Terraform Plan 📋 `prod/monitoring`

**Summary:** 11:51:04.196 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.

<details><summary>Show Plan Details</summary>

```terraform
11:51:04.194 STDOUT terraform:                     nodeSelector:
11:51:04.194 STDOUT terraform:                       service: monitoring
11:51:04.195 STDOUT terraform:                     storage:
11:51:04.195 STDOUT terraform:                       storageClassName: do-block-storage
11:51:04.195 STDOUT terraform:                       accessModes:
11:51:04.195 STDOUT terraform:                         - ReadWriteOnce
11:51:04.195 STDOUT terraform:                       resources:
11:51:04.195 STDOUT terraform:                         requests:
11:51:04.195 STDOUT terraform:                           storage: "10Gi"
11:51:04.195 STDOUT terraform:                 
11:51:04.195 STDOUT terraform:                 # Disable cluster version by default
11:51:04.195 STDOUT terraform:                 vmcluster:
11:51:04.195 STDOUT terraform:                   enabled: false
11:51:04.195 STDOUT terraform:                 
11:51:04.195 STDOUT terraform:                 vmagent:
11:51:04.195 STDOUT terraform:                   enabled: true
11:51:04.195 STDOUT terraform:                   spec:
11:51:04.195 STDOUT terraform:                     tolerations:
11:51:04.195 STDOUT terraform:                       - key: "service"
11:51:04.195 STDOUT terraform:                         operator: "Equal"
11:51:04.195 STDOUT terraform:                         value: "monitoring"
11:51:04.195 STDOUT terraform:                         effect: "NoSchedule"
11:51:04.195 STDOUT terraform:                     nodeSelector:
11:51:04.195 STDOUT terraform:                       service: monitoring
11:51:04.195 STDOUT terraform:                 
11:51:04.195 STDOUT terraform:                 vmalert:
11:51:04.195 STDOUT terraform:                   enabled: true
11:51:04.195 STDOUT terraform:                   spec:
11:51:04.195 STDOUT terraform:                     tolerations:
11:51:04.195 STDOUT terraform:                       - key: "service"
11:51:04.195 STDOUT terraform:                         operator: "Equal"
11:51:04.195 STDOUT terraform:                         value: "monitoring"
11:51:04.195 STDOUT terraform:                         effect: "NoSchedule"
11:51:04.195 STDOUT terraform:                     nodeSelector:
11:51:04.195 STDOUT terraform:                       service: monitoring
11:51:04.195 STDOUT terraform:                 
11:51:04.195 STDOUT terraform:                 grafana:
11:51:04.195 STDOUT terraform:                   enabled: true
11:51:04.195 STDOUT terraform:                   ingress:
11:51:04.195 STDOUT terraform:                     enabled: false
11:51:04.195 STDOUT terraform:                   persistence:
11:51:04.195 STDOUT terraform:                     enabled: true
11:51:04.195 STDOUT terraform:                     storageClassName: do-block-storage
11:51:04.195 STDOUT terraform:                     size: "2Gi"
11:51:04.195 STDOUT terraform:                   tolerations:
11:51:04.195 STDOUT terraform:                     - key: "service"
11:51:04.195 STDOUT terraform:                       operator: "Equal"
11:51:04.195 STDOUT terraform:                       value: "monitoring"
11:51:04.195 STDOUT terraform:                       effect: "NoSchedule"
11:51:04.195 STDOUT terraform:                   nodeSelector:
11:51:04.195 STDOUT terraform:                     service: monitoring
11:51:04.195 STDOUT terraform:                 
11:51:04.195 STDOUT terraform:                 kube-state-metrics:
11:51:04.195 STDOUT terraform:                   tolerations:
11:51:04.195 STDOUT terraform:                     - key: "service"
11:51:04.195 STDOUT terraform:                       operator: "Equal"
11:51:04.195 STDOUT terraform:                       value: "monitoring"
11:51:04.195 STDOUT terraform:                       effect: "NoSchedule"
11:51:04.195 STDOUT terraform:                   nodeSelector:
11:51:04.195 STDOUT terraform:                     service: monitoring
11:51:04.195 STDOUT terraform:                 
11:51:04.195 STDOUT terraform:                 prometheus-node-exporter:
11:51:04.195 STDOUT terraform:                   tolerations:
11:51:04.195 STDOUT terraform:                     - key: "service"
11:51:04.195 STDOUT terraform:                       operator: "Exists"
11:51:04.195 STDOUT terraform:                       effect: "NoSchedule"
11:51:04.195 STDOUT terraform:                 
11:51:04.195 STDOUT terraform:                 # Setup easy access for initial testing
11:51:04.195 STDOUT terraform:                 serviceAccount:
11:51:04.196 STDOUT terraform:                   create: true
11:51:04.196 STDOUT terraform:             EOT,
11:51:04.196 STDOUT terraform:         ]
11:51:04.196 STDOUT terraform:       + verify                     = false
11:51:04.196 STDOUT terraform:       + version                    = "0.72.4"
11:51:04.196 STDOUT terraform:       + wait                       = true
11:51:04.196 STDOUT terraform:       + wait_for_jobs              = false
11:51:04.196 STDOUT terraform:     }
11:51:04.196 STDOUT terraform:   # kubernetes_namespace_v1.monitoring will be created
11:51:04.196 STDOUT terraform:   + resource "kubernetes_namespace_v1" "monitoring" {
11:51:04.196 STDOUT terraform:       + id                               = (known after apply)
11:51:04.196 STDOUT terraform:       + wait_for_default_service_account = false
11:51:04.196 STDOUT terraform:       + metadata {
11:51:04.196 STDOUT terraform:           + generation       = (known after apply)
11:51:04.196 STDOUT terraform:           + labels           = {
11:51:04.196 STDOUT terraform:               + "name" = "monitoring"
11:51:04.196 STDOUT terraform:             }
11:51:04.196 STDOUT terraform:           + name             = "monitoring"
11:51:04.196 STDOUT terraform:           + resource_version = (known after apply)
11:51:04.196 STDOUT terraform:           + uid              = (known after apply)
11:51:04.196 STDOUT terraform:         }
11:51:04.196 STDOUT terraform:     }
11:51:04.196 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
11:51:04.196 STDOUT terraform: Changes to Outputs:
11:51:04.196 STDOUT terraform:   + helm_release_name   = "vm-stack"
11:51:04.196 STDOUT terraform:   + helm_release_status = "deployed"
11:51:04.196 STDOUT terraform:   + namespace           = "monitoring"
11:51:04.285 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
11:51:04.285 STDOUT terraform: Saved the plan to: tfplan
11:51:04.285 STDOUT terraform: To perform exactly these actions, run the following command to apply:
11:51:04.285 STDOUT terraform:     terraform apply "tfplan"
```

</details>

*Pusher: @krukmaksym, Action: `pull_request`, Workflow: `Terraform PR Validation`*